micropython/micropython/ports/esp32/modwifi_csi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 Francesco Pace <francesco.pace@gmail.com>
 * Copyright (c) 2025 MicroPython CSI Module Contributors
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/mphal.h"
#include "py/objarray.h"
#include "py/runtime.h"
#include "py/ringbuf.h"

#if MICROPY_PY_NETWORK_WLAN_CSI

#include "esp_log.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "modwifi_csi.h"
#include "modnetwork.h"
#include <string.h>

// ============================================================================
// Gain Lock Support (ESP32-S3, C3, C5, C6 only)
// ============================================================================
// Based on Espressif esp-csi recommendations for stable CSI measurements.
// These PHY functions are in the ESP-IDF PHY blob but not in public headers.
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6
#define WIFI_CSI_GAIN_LOCK_SUPPORTED 1
extern void phy_fft_scale_force(bool force_en, uint8_t force_value);
extern void phy_force_rx_gain(int force_en, int force_value);

// PHY RX Control structure to access hidden gain fields
// From Espressif esp-csi example:
// https://github.com/espressif/esp-csi/blob/master/examples/get-started/csi_recv_router/main/app_main.c
// Note: This overlays wifi_csi_info_t to access undocumented PHY fields
typedef struct {
    unsigned : 32;  // reserved
    unsigned : 32;  // reserved
    unsigned : 32;  // reserved
    unsigned : 32;  // reserved
    unsigned : 32;  // reserved
    unsigned : 16;  // reserved
    unsigned fft_gain : 8;
    unsigned agc_gain : 8;
    unsigned : 32;  // reserved
    unsigned : 32;  // reserved
    #if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C5
    unsigned : 32;  // reserved (extra padding for S3, C3, C5 - not C6)
    unsigned : 32;  // reserved
    unsigned : 32;  // reserved
    #endif
    unsigned : 32;  // reserved
} wifi_pkt_rx_ctrl_phy_t;
#else
#define WIFI_CSI_GAIN_LOCK_SUPPORTED 0
#endif

static const char *TAG = "wifi_csi";

// Global CSI state (static - only used within this file)
// C99 mandates all static structure fields to be initialized with 0/NULL unless specified otherwise
static csi_state_t g_csi_state = {};

// ============================================================================
// CSI Callback (ISR Context)
// ============================================================================

void IRAM_ATTR wifi_csi_rx_cb(void *ctx, wifi_csi_info_t *info) {
    if (g_csi_state.ringbuffer.buf == NULL) {
        return;
    }

    // Use static frame to avoid stack overflow in ISR context
    // (csi_frame_t is ~543 bytes, too large for ISR stack which is typically 2-4KB)
    static csi_frame_t frame;

    // Extract metadata
    // Note: ESP32-C5/C6 have a different rx_ctrl structure with fewer fields
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C5
    // ESP32-C5/C6: Many fields are not available in esp_wifi_rxctrl_t
    // Initialize all fields to zero, then assign available ones
    memset(&frame, 0, sizeof(csi_frame_t));
    // Fields not available in C5/C6 rx_ctrl are already zero from memset above
    // Now assign available fields
    frame.rssi = info->rx_ctrl.rssi;
    frame.rate = info->rx_ctrl.rate;
    #else
    // ESP32, ESP32-S2, ESP32-S3, ESP32-C3: Full rx_ctrl structure available
    // Note: No memset needed here - all fields are explicitly assigned below,
    // unlike C5/C6 where some fields are unavailable and must be zero-initialized
    frame.rssi = info->rx_ctrl.rssi;
    frame.rate = info->rx_ctrl.rate;
    frame.sig_mode = info->rx_ctrl.sig_mode;
    frame.mcs = info->rx_ctrl.mcs;
    frame.cwb = info->rx_ctrl.cwb;
    frame.smoothing = info->rx_ctrl.smoothing;
    frame.not_sounding = info->rx_ctrl.not_sounding;
    frame.aggregation = info->rx_ctrl.aggregation;
    frame.stbc = info->rx_ctrl.stbc;
    frame.fec_coding = info->rx_ctrl.fec_coding;
    frame.sgi = info->rx_ctrl.sgi;
    frame.ampdu_cnt = info->rx_ctrl.ampdu_cnt;
    frame.secondary_channel = info->rx_ctrl.secondary_channel;
    frame.ant = info->rx_ctrl.ant;
    #endif

    // Common fields available on all targets
    frame.noise_floor = info->rx_ctrl.noise_floor;
    frame.channel = info->rx_ctrl.channel;
    frame.local_timestamp = info->rx_ctrl.timestamp;
    frame.sig_len = info->rx_ctrl.sig_len;
    frame.rx_state = info->rx_ctrl.rx_state;

    // Copy MAC address
    memcpy(frame.mac, info->mac, 6);

    // Extract gain fields from hidden PHY structure (ESP32-S3, C3, C5, C6 only)
    #if WIFI_CSI_GAIN_LOCK_SUPPORTED
    const wifi_pkt_rx_ctrl_phy_t *phy_info = (const wifi_pkt_rx_ctrl_phy_t *)info;
    frame.fft_gain = phy_info->fft_gain;
    frame.agc_gain = phy_info->agc_gain;
    #else
    frame.agc_gain = 0;
    frame.fft_gain = 0;
    #endif

    // Get timestamp
    frame.timestamp_us = (uint32_t)esp_timer_get_time();

