micropython/micropython/ports/esp32/modwifi_csi.c
    // Copy CSI data (info->buf is int8_t*, info->len is in bytes)
    if (info->buf != NULL && info->len > 0) {
        frame.len = info->len > CSI_MAX_DATA_LEN ? CSI_MAX_DATA_LEN : info->len;
        memcpy(frame.data, info->buf, frame.len);
    } else {
        frame.len = 0;
    }

    // Write to circular buffer
    int result = ringbuf_put_bytes(&g_csi_state.ringbuffer, (uint8_t *)&frame, sizeof(csi_frame_t));
    if (result != 0) {
        g_csi_state.dropped++;
    }
}

// ============================================================================
// CSI Control Functions
// ============================================================================

// Forward declarations
static esp_err_t wifi_csi_enable(void);
static esp_err_t wifi_csi_disable(void);

// Helper function to build modern API (C5/C6) CSI config from unified config
#if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C5
static void build_modern_csi_config(wifi_csi_config_t *out, const csi_config_t *in) {
    // Build modern API (C5/C6) CSI config from unified config
    // All values are read from the unified config structure, showing default values explicitly
    *out = (wifi_csi_config_t) {
        .enable = 1,  // Master enable (REQUIRED)
        .acquire_csi_legacy = 1,  // Always enabled for modern API (fallback for legacy routers, optimized for motion detection)
        .acquire_csi_ht20 = in->htltf_en,  // From ht_ltf parameter (default: true)
        .acquire_csi_ht40 = in->acquire_csi_ht40,  // Default: false (less stable)
        .acquire_csi_su = in->acquire_csi_su,  // Default: true (WiFi 6 support)
        .acquire_csi_mu = in->acquire_csi_mu,  // Default: false (rarely used)
        .acquire_csi_dcm = in->acquire_csi_dcm,  // Default: false (not commonly used)
        .acquire_csi_beamformed = in->acquire_csi_beamformed,  // Default: false (alters channel estimation)
        .val_scale_cfg = in->val_scale_cfg,  // From scale parameter (default: 0 = auto-scaling)
        .dump_ack_en = in->dump_ack_en,  // From capture_ack parameter (default: false)
    };
    #if CONFIG_IDF_TARGET_ESP32C6
    out->acquire_csi_he_stbc = in->stbc_htltf2_en;  // From stbc parameter (default: false)
    #endif
}

// Helper function to build legacy CSI config from unified config
#else
static void build_legacy_csi_config(wifi_csi_config_t *out, const csi_config_t *in) {
    // Build legacy API (ESP32, ESP32-S2, ESP32-S3, ESP32-C3) CSI config from unified config
    // All values are read from the unified config structure, showing default values explicitly
    *out = (wifi_csi_config_t) {
        .lltf_en = in->lltf_en,  // From legacy_ltf parameter (default: false, HT-LTF only)
        .htltf_en = in->htltf_en,  // From ht_ltf parameter (default: true, PRIMARY - best SNR)
        .stbc_htltf2_en = in->stbc_htltf2_en,  // From stbc parameter (default: false)
        .ltf_merge_en = in->ltf_merge_en,  // Default: false (no merge, HT-LTF only)
        .channel_filter_en = in->channel_filter_en,  // Default: false (raw subcarriers)
        .manu_scale = in->manu_scale,  // From scale parameter (None/0=auto=false, 1-15=manual=true)
        .shift = in->shift,  // From scale parameter (1-15) when manu_scale=true, default: 0
        .dump_ack_en = in->dump_ack_en,  // From capture_ack parameter (default: false)
    };
}
#endif

static esp_err_t wifi_csi_enable(void) {
    if (g_csi_state.ringbuffer.buf != NULL) {
        ESP_LOGI(TAG, "Already enabled");
        return ESP_OK;
    }

    esp_err_t ret;

    ESP_LOGI(TAG, "Starting CSI enable sequence...");

    // Configure WiFi protocol mode
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C5
    // ESP32-C5/C6: Enable WiFi 6 (802.11ax) for improved performance and CSI
    // capture
    ESP_LOGI(TAG, "Setting WiFi protocol to 802.11b/g/n/ax...");
    ret = esp_wifi_set_protocol(WIFI_IF_STA,
        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
        WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AX);
    ESP_LOGD(TAG, "esp_wifi_set_protocol returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set WiFi protocol: 0x%x (CSI requires proper protocol mode)", ret);
        return ret;
    }
    ESP_LOGI(TAG, "WiFi protocol set to 802.11b/g/n/ax (WiFi 6 enabled)");
    #else
    // ESP32, ESP32-S2, ESP32-S3, ESP32-C3: WiFi 4 only (802.11b/g/n)
    ret = esp_wifi_set_protocol(
        WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set WiFi protocol: 0x%x (CSI requires proper protocol mode)", ret);
        return ret;
    }
    ESP_LOGI(TAG, "WiFi protocol set to 802.11b/g/n");
    #endif

    // Configure WiFi bandwidth (HT20 for stability)
    ESP_LOGI(TAG, "Setting WiFi bandwidth to HT20...");
    ret = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
    ESP_LOGD(TAG, "esp_wifi_set_bandwidth returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set bandwidth: 0x%x", ret);
    } else {
        ESP_LOGI(TAG, "WiFi bandwidth set to HT20 (20MHz)");
    }

    // IMPORTANT: For ESP32-C6, promiscuous mode MUST be called BEFORE configuring
    // CSI This initializes internal WiFi structures required for CSI, even when
    // set to false
    ESP_LOGI(TAG, "Initializing promiscuous mode (false)...");
    ret = esp_wifi_set_promiscuous(false);
    ESP_LOGD(TAG, "esp_wifi_set_promiscuous returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set promiscuous mode: 0x%x", ret);
        return ret;
    }
    ESP_LOGI(TAG, "Promiscuous mode: disabled (CSI from connected AP only)");

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C5
    // Modern API (C5/C6): WiFi 6 config
    // CRITICAL: Must specify which CSI types to acquire, otherwise callback is never invoked!
    wifi_csi_config_t csi_config;
    build_modern_csi_config(&csi_config, &g_csi_state.config);
    #else
    // Legacy API (ESP32, ESP32-S2, ESP32-S3, ESP32-C3): use legacy CSI API with LTF fields
    wifi_csi_config_t csi_config;
    build_legacy_csi_config(&csi_config, &g_csi_state.config);
    #endif

    ESP_LOGI(TAG, "Setting CSI config...");
    ret = esp_wifi_set_csi_config(&csi_config);
    ESP_LOGD(TAG, "esp_wifi_set_csi_config returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set CSI config: 0x%x", ret);
        return ret;
    }

    ESP_LOGI(TAG, "Registering CSI callback...");
    ret = esp_wifi_set_csi_rx_cb(wifi_csi_rx_cb, NULL);
    ESP_LOGD(TAG, "esp_wifi_set_csi_rx_cb returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register callback: 0x%x", ret);
        return ret;
    }
    // Note: If we fail after this point, callback remains registered but won't be called
    // because buffer is NULL (checked in wifi_csi_rx_cb)

    ESP_LOGI(TAG, "Allocating buffer (size=%lu frames)...",
        (unsigned long)g_csi_state.config.buffer_size);
    csi_frame_t *frames_buffer = m_new(csi_frame_t, g_csi_state.config.buffer_size);
    if (!frames_buffer) {
        ESP_LOGE(TAG, "Failed to allocate CSI buffer");
        esp_wifi_set_csi_rx_cb(NULL, NULL);
        return ESP_ERR_NO_MEM;
    }
    ESP_LOGI(TAG, "Buffer allocated OK");

    // Store buffer in root pointer to prevent GC from collecting it
    // This is critical: without this, the GC could free the buffer while
    // the ISR callback is still writing to it, causing heap corruption.
    MP_STATE_PORT(csi_ringbuf_root) = frames_buffer;

