micropython/micropython/ports/esp32/modwifi_csi.c
    // Initialize ringbuffer fields BEFORE setting buf pointer.
    // The ISR checks buf != NULL to determine if CSI is active, so buf must
    // be set LAST to ensure size/iget/iput are valid when ISR starts writing.
    g_csi_state.ringbuffer.size = sizeof(csi_frame_t) * g_csi_state.config.buffer_size;
    g_csi_state.ringbuffer.iget = 0;
    g_csi_state.ringbuffer.iput = 0;
    g_csi_state.ringbuffer.buf = (uint8_t *)frames_buffer;  // Enable ISR writes LAST

    // Enable CSI LAST
    ESP_LOGI(TAG, "Calling esp_wifi_set_csi(true)...");
    ret = esp_wifi_set_csi(true);
    ESP_LOGD(TAG, "esp_wifi_set_csi returned: 0x%x (ESP_OK=0x%x)", ret, ESP_OK);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable CSI (error code: 0x%x)", ret);
        ESP_LOGE(TAG, "Common causes:");
        ESP_LOGE(TAG, "  - WiFi not connected");
        ESP_LOGE(TAG, "  - CSI config invalid");
        ESP_LOGE(TAG, "  - Hardware limitation");
        // Clean up buffer if CSI enable failed
        m_del(csi_frame_t, (csi_frame_t *)g_csi_state.ringbuffer.buf, g_csi_state.config.buffer_size);
        g_csi_state.ringbuffer.buf = NULL;
        MP_STATE_PORT(csi_ringbuf_root) = NULL;
        return ret;
    }

    #if CONFIG_IDF_TARGET_ESP32C6
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C6 mode - WiFi 6 support)");
    #elif CONFIG_IDF_TARGET_ESP32C5
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C5 mode - WiFi 6 support)");
    #elif CONFIG_IDF_TARGET_ESP32S3
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-S3 mode)");
    #elif CONFIG_IDF_TARGET_ESP32S2
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-S2 mode)");
    #elif CONFIG_IDF_TARGET_ESP32C3
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C3 mode)");
    #else
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32 mode)");
    #endif

    return ESP_OK;
}

static esp_err_t wifi_csi_disable(void) {
    if (g_csi_state.ringbuffer.buf == NULL) {
        return ESP_OK;
    }

    // Disable CSI first to stop new callbacks from being invoked
    esp_err_t ret = esp_wifi_set_csi(false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to disable CSI: %d", ret);
        return ret;
    }

    // Then unregister callback (safe now that CSI is disabled)
    ret = esp_wifi_set_csi_rx_cb(NULL, NULL);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to unregister CSI callback: %d", ret);
        return ret;
    }

    // Clean up: deallocate buffer and clear root pointer
    m_del(csi_frame_t, (csi_frame_t *)g_csi_state.ringbuffer.buf, g_csi_state.config.buffer_size);
    g_csi_state.ringbuffer.buf = NULL;
    MP_STATE_PORT(csi_ringbuf_root) = NULL;
    g_csi_state.dropped = 0;

    ESP_LOGI(TAG, "CSI disabled and state cleaned");
    return ESP_OK;
}

static bool wifi_csi_read_frame(csi_frame_t *frame) {
    // Disable interrupts to prevent race condition with ISR callback (wifi_csi_rx_cb)
    // which writes to the same ringbuffer. This ensures atomic read of the frame.
    mp_uint_t atomic_state = MICROPY_BEGIN_ATOMIC_SECTION();
    int result = ringbuf_get_bytes(&g_csi_state.ringbuffer, (uint8_t *)frame, sizeof(csi_frame_t));
    MICROPY_END_ATOMIC_SECTION(atomic_state);
    return result == 0;
}

// ============================================================================
// MicroPython Bindings
// ============================================================================

// wlan.csi_enable(**kwargs)
static mp_obj_t network_wlan_csi_enable(size_t n_args, const mp_obj_t *args,
    mp_map_t *kw_args) {
    (void)args[0]; // WLAN object not used, CSI is global state

    enum {
        ARG_buffer_size,
        ARG_legacy_ltf,
        ARG_ht_ltf,
        ARG_stbc,
        ARG_capture_ack,
        ARG_scale,
    };
    static const mp_arg_t allowed_args[] = {
        {MP_QSTR_buffer_size,
         MP_ARG_KW_ONLY | MP_ARG_INT,
         {.u_int = MICROPY_PY_NETWORK_WLAN_CSI_DEFAULT_BUFFER_SIZE}},
        {MP_QSTR_legacy_ltf, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}},  // Legacy API: Enable L-LTF / Modern API: acquire_csi_legacy always 1
        {MP_QSTR_ht_ltf, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true}},  // HT-LTF enabled (PRIMARY - best SNR)
        {MP_QSTR_stbc, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}},  // STBC HT-LTF2 / HE-STBC (disabled for consistency)
        {MP_QSTR_capture_ack, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}},  // Capture ACK frames (adds noise, not useful)
        {MP_QSTR_scale, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}},  // Scale value: None/0=auto, 1-15=manual shift
    };

    mp_arg_val_t parsed_args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, args + 1, kw_args, MP_ARRAY_SIZE(allowed_args),
        allowed_args, parsed_args);

    // Validate buffer_size before modifying state
    uint32_t buffer_size = parsed_args[ARG_buffer_size].u_int;
    if (buffer_size < 1 || buffer_size > 1024) {
        mp_raise_ValueError(
            MP_ERROR_TEXT("buffer_size must be between 1 and 1024"));
    }

    // Update configuration with provided parameters
    g_csi_state.config.buffer_size = buffer_size;
    g_csi_state.config.lltf_en = parsed_args[ARG_legacy_ltf].u_bool;
    g_csi_state.config.htltf_en = parsed_args[ARG_ht_ltf].u_bool;
    g_csi_state.config.stbc_htltf2_en = parsed_args[ARG_stbc].u_bool;
    g_csi_state.config.dump_ack_en = parsed_args[ARG_capture_ack].u_bool;

    // Set WiFi 6 (C5/C6) defaults - these are not exposed as Python parameters
    // acquire_csi_su=true enables HE-LTF CSI from 802.11ax HE20 SU packets (essential for WiFi 6 routers)
    g_csi_state.config.acquire_csi_su = true;
    g_csi_state.config.acquire_csi_ht40 = false;  // HT40 less stable
    g_csi_state.config.acquire_csi_mu = false;    // MU-MIMO rarely used
    g_csi_state.config.acquire_csi_dcm = false;   // DCM not commonly used
    g_csi_state.config.acquire_csi_beamformed = false;  // Alters channel estimation

    // Map scale to appropriate API parameters
    // If scale is None or 0: auto-scaling
    // If scale is 1-15: manual scaling with shift value
    mp_obj_t scale_obj = parsed_args[ARG_scale].u_obj;
    if (scale_obj == MP_OBJ_NULL || scale_obj == mp_const_none) {
        // Auto-scaling (default)
        g_csi_state.config.manu_scale = false;  // Legacy API: auto-scaling
        g_csi_state.config.val_scale_cfg = 0;   // Modern API: auto-scaling
        g_csi_state.config.shift = 0;
    } else {
        // Manual scaling: get shift value from scale parameter
        int scale_val = mp_obj_get_int(scale_obj);
        if (scale_val < 0 || scale_val > 15) {
            mp_raise_ValueError(MP_ERROR_TEXT("scale must be 0-15 or None"));
        }
        if (scale_val == 0) {
            // scale=0 means auto-scaling
            g_csi_state.config.manu_scale = false;
            g_csi_state.config.val_scale_cfg = 0;
            g_csi_state.config.shift = 0;
        } else {
            // scale=1-15: manual scaling with shift
            g_csi_state.config.manu_scale = true;  // Legacy API: manual scaling
            g_csi_state.config.shift = scale_val;
            // Map shift (0-15) to val_scale_cfg (1-7) for modern API
            uint8_t val_scale = (scale_val / 2) + 1;
            if (val_scale > 7) {
                val_scale = 7;
            }
            g_csi_state.config.val_scale_cfg = val_scale;  // Set directly, so helper can just read it
        }
    }

