micropython/micropython/ports/esp32/modwifi_csi.c
    // Enable CSI with the configuration
    esp_exceptions(wifi_csi_enable());

    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(network_wlan_csi_enable_obj, 1,
    network_wlan_csi_enable);

// wlan.csi_disable()
static mp_obj_t network_wlan_csi_disable(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state
    esp_exceptions(wifi_csi_disable());
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_disable_obj,
    network_wlan_csi_disable);

// wlan.csi_read() -> tuple or None
// Returns tuple: (rssi, channel, mac, timestamp, local_timestamp, data, rate, sig_mode,
//                 mcs, cwb, smoothing, not_sounding, aggregation, stbc, fec_coding, sgi,
//                 noise_floor, ampdu_cnt, secondary_channel, ant, sig_len, rx_state,
//                 agc_gain, fft_gain)
// Note: agc_gain and fft_gain are only valid on ESP32-S3, C3, C5, C6 (0 on other platforms)
static mp_obj_t network_wlan_csi_read(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state

    csi_frame_t frame;

    if (!wifi_csi_read_frame(&frame)) {
        return mp_const_none;
    }

    // Create tuple with frame data (order: most important fields first)
    // Tuple order matches logical importance: rssi, channel, mac, timestamps, data, then metadata
    // Added agc_gain and fft_gain at the end for backward compatibility
    mp_obj_t items[24];

    // Use MP_OBJ_NEW_SMALL_INT for values known to fit in a small int (faster than mp_obj_new_int)
    // Small ints avoid heap allocation and the runtime check in mp_obj_new_int.
    // Use mp_obj_new_int for 32-bit timestamps that may exceed small int range.
    items[0] = MP_OBJ_NEW_SMALL_INT(frame.rssi);  // int8_t
    items[1] = MP_OBJ_NEW_SMALL_INT(frame.channel);  // uint8_t
    items[2] = mp_obj_new_bytes(frame.mac, 6);
    items[3] = mp_obj_new_int(frame.timestamp_us);  // uint32_t - may exceed small int
    items[4] = mp_obj_new_int(frame.local_timestamp);  // uint32_t - may exceed small int

    // CSI data as array('b') - int8_t values matching ESP-IDF API
    mp_obj_array_t *csi_array =
        MP_OBJ_TO_PTR(mp_obj_new_bytearray(frame.len, frame.data));
    csi_array->typecode = 'b';
    items[5] = MP_OBJ_FROM_PTR(csi_array);

    // Metadata fields - all are uint8_t or uint16_t, safe for small int
    items[6] = MP_OBJ_NEW_SMALL_INT(frame.rate);  // uint8_t
    items[7] = MP_OBJ_NEW_SMALL_INT(frame.sig_mode);  // uint8_t
    items[8] = MP_OBJ_NEW_SMALL_INT(frame.mcs);  // uint8_t
    items[9] = MP_OBJ_NEW_SMALL_INT(frame.cwb);  // uint8_t
    items[10] = MP_OBJ_NEW_SMALL_INT(frame.smoothing);  // uint8_t
    items[11] = MP_OBJ_NEW_SMALL_INT(frame.not_sounding);  // uint8_t
    items[12] = MP_OBJ_NEW_SMALL_INT(frame.aggregation);  // uint8_t
    items[13] = MP_OBJ_NEW_SMALL_INT(frame.stbc);  // uint8_t
    items[14] = MP_OBJ_NEW_SMALL_INT(frame.fec_coding);  // uint8_t
    items[15] = MP_OBJ_NEW_SMALL_INT(frame.sgi);  // uint8_t
    items[16] = MP_OBJ_NEW_SMALL_INT(frame.noise_floor);  // int8_t
    items[17] = MP_OBJ_NEW_SMALL_INT(frame.ampdu_cnt);  // uint8_t
    items[18] = MP_OBJ_NEW_SMALL_INT(frame.secondary_channel);  // uint8_t
    items[19] = MP_OBJ_NEW_SMALL_INT(frame.ant);  // uint8_t
    items[20] = MP_OBJ_NEW_SMALL_INT(frame.sig_len);  // uint16_t
    items[21] = MP_OBJ_NEW_SMALL_INT(frame.rx_state);  // uint8_t
    // Gain fields (ESP32-S3, C3, C5, C6 only - 0 on other platforms)
    items[22] = MP_OBJ_NEW_SMALL_INT(frame.agc_gain);  // uint8_t
    items[23] = MP_OBJ_NEW_SMALL_INT(frame.fft_gain);  // uint8_t

    return mp_obj_new_tuple(24, items);
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_read_obj, network_wlan_csi_read);

// wlan.csi_dropped() -> int
static mp_obj_t network_wlan_csi_dropped(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state
    return mp_obj_new_int(g_csi_state.dropped);
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_dropped_obj,
    network_wlan_csi_dropped);

// wlan.csi_available() -> int
static mp_obj_t network_wlan_csi_available(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state

    if (g_csi_state.ringbuffer.buf == NULL) {
        return MP_OBJ_NEW_SMALL_INT(0);
    }

    // Disable interrupts to get consistent read of ringbuffer state
    mp_uint_t atomic_state = MICROPY_BEGIN_ATOMIC_SECTION();
    size_t available_bytes = ringbuf_avail(&g_csi_state.ringbuffer);
    MICROPY_END_ATOMIC_SECTION(atomic_state);

    // Convert bytes to frame count (max 1024 frames, fits in small int)
    return MP_OBJ_NEW_SMALL_INT(available_bytes / sizeof(csi_frame_t));
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_available_obj,
    network_wlan_csi_available);

// ============================================================================
// Gain Lock Functions
// ============================================================================

// wlan.csi_force_gain(agc, fft)
// Forces AGC and FFT gain to fixed values for stable CSI measurements.
// This eliminates amplitude variations caused by automatic gain control.
//
// Args:
//   agc: AGC gain value (0-255), or None to re-enable automatic control
//   fft: FFT gain value (0-255), or None to re-enable automatic control
//
// Usage:
//   # Lock gain after calibration (typical values from 300-packet average)
//   wlan.csi_force_gain(39, 215)
//
//   # Re-enable automatic gain control
//   wlan.csi_force_gain(None, None)
//
// Supported: ESP32-S3, ESP32-C3, ESP32-C5, ESP32-C6
// Not supported: ESP32, ESP32-S2 (raises NotImplementedError)
static mp_obj_t network_wlan_csi_force_gain(mp_obj_t self_in, mp_obj_t agc_obj, mp_obj_t fft_obj) {
    (void)self_in;

    #if WIFI_CSI_GAIN_LOCK_SUPPORTED
    if (agc_obj == mp_const_none && fft_obj == mp_const_none) {
        // Disable forced gain, re-enable AGC
        phy_force_rx_gain(0, 0);
        phy_fft_scale_force(false, 0);
        ESP_LOGI(TAG, "Gain lock disabled (AGC re-enabled)");
    } else if (agc_obj == mp_const_none || fft_obj == mp_const_none) {
        mp_raise_ValueError(MP_ERROR_TEXT("Both agc and fft must be set, or both None"));
    } else {
        // Force both gains
        int agc = mp_obj_get_int(agc_obj);
        int fft = mp_obj_get_int(fft_obj);

        if (agc < 0 || agc > 255 || fft < 0 || fft > 255) {
            mp_raise_ValueError(MP_ERROR_TEXT("agc and fft must be 0-255"));
        }

        phy_fft_scale_force(true, (uint8_t)fft);
        phy_force_rx_gain(1, agc);
        ESP_LOGI(TAG, "Gain locked: AGC=%d, FFT=%d", agc, fft);
    }
    return mp_const_none;
    #else
    (void)agc_obj;
    (void)fft_obj;
    mp_raise_NotImplementedError(MP_ERROR_TEXT("Gain lock not supported on ESP32/ESP32-S2"));
    return mp_const_none;
    #endif
}
MP_DEFINE_CONST_FUN_OBJ_3(network_wlan_csi_force_gain_obj, network_wlan_csi_force_gain);

// wlan.csi_gain_lock_supported()
// Returns True if gain lock is supported on this platform.
static mp_obj_t network_wlan_csi_gain_lock_supported(mp_obj_t self_in) {
    (void)self_in;
    #if WIFI_CSI_GAIN_LOCK_SUPPORTED
    return mp_const_true;
    #else
    return mp_const_false;
    #endif
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_gain_lock_supported_obj, network_wlan_csi_gain_lock_supported);

// Register root pointer to prevent GC from collecting the CSI buffer.
// The buffer is allocated with m_new() and stored in g_csi_state.ringbuffer.buf.
// Without this, the GC would not see any Python reference to the buffer
// and could free it while the ISR callback is still writing to it, causing
// heap corruption (TLSF assertion: block_size(block) >= size).
MP_REGISTER_ROOT_POINTER(void *csi_ringbuf_root);

#endif // MICROPY_PY_NETWORK_WLAN_CSI
